 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROL.
 ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
       SOURCE-COMPUTER. XYZ WITH DEBUGGING MODE.
       OBJECT-COMPUTER. ZYX 
           MEMORY 8192 CHARACTERS
           DISK 4096 WORDS
           COLLATING SEQUENCE Special-Sequence1 Special-Sequence2 
               ALPHANUMERIC Special-Sequence-Alpha 
               NATIONAL Special-Sequence-National
           SEGMENT-LIMIT 128.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT TEACHER
       ASSIGN TO 'teacher.txt'
       ORGANIZATION IS RECORD INDEXED
       PADDING CHARACTER IS '-'
       RECORD DELIMITER IMPLICIT
       ACCESS MODE IS DYNAMIC
       RECORD SOMEDATANAME PASSWORD SOMEPASSWORD
       ALTERNATE RECORD SOMEDATANAME2 PASSWORD SOMEPASSWORD
       RESERVE 10
       FILE STATUS IS SOMEFILESTATUS1 SOMEFILESTATUS2
       RELATIVE KEY SOMEDATANAME
       PASSWORD SOMEPASSWORD.